# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# =============================================
# CLI Tools
# =============================================
brew "bat"              # Better cat
brew "eza"              # Better ls
brew "fzf"              # Fuzzy finder
brew "git"              # Version control
brew "starship"         # Prompt
brew "zoxide"           # Smarter cd
brew "ripgrep"          # Fast grep (rg)
brew "fd"               # Fast find
brew "tldr"             # Simplified man pages
brew "jq"               # JSON processor
brew "htop"             # Better top
brew "btop"             # Beautiful system monitor
brew "tree"             # Directory tree
brew "wget"             # Download files
brew "gh"               # GitHub CLI
brew "lazygit"          # Terminal UI for git
brew "delta"            # Better git diffs

# =============================================
# Development
# =============================================
brew "node"
brew "pnpm"
brew "go"
brew "python"

# =============================================
# Apps
# =============================================
cask "ghostty"
cask "visual-studio-code"
cask "figma"
cask "notion"
cask "slack"
cask "discord"
cask "postman"
cask "docker"

# =============================================
# Fonts
# =============================================
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"